tests/fixtures/artifact-replay/fp-bad-dimension/case/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
    source
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    sink
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    skin
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    span
    {
        type empty;
    }
}
