tests/fixtures/artifact-replay/fp-bad-dimension/case/0/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    source
    {
        type fixedValue;
        value uniform 0;
    }
    sink
    {
        type fixedValue;
        value uniform 0;
    }
    skin
    {
        type fixedValue;
        value uniform 0;
    }
    span
    {
        type empty;
    }
}
