tests/fixtures/artifact-replay/fp-bad-dimension/case/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers
{
    p { solver PCG; preconditioner DIC; tolerance 1e-06; relTol 0; }
    U { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-06; relTol 0; }
}
PISO { nCorrectors 2; nNonOrthogonalCorrectors 0; }
